In [1]:
import pandas as pd

# Replace 'your_file.tsv' with the path to your actual TSV file
df = pd.read_csv('zippedData/rt.movie_info.tsv', sep='\t')

# Display the first few rows to confirm it's loaded correctly
print(df.head())

   id                                           synopsis rating  \
0   1  This gritty, fast-paced, and innovative police...      R
1   3  New York City, not-too-distant-future: Eric Pa...      R
2   5  Illeana Douglas delivers a superb performance ...      R
3   6  Michael Douglas runs afoul of a treacherous su...      R
4   7                                                NaN     NR

                                 genre          director  \
0  Action and Adventure|Classics|Drama  William Friedkin
1    Drama|Science Fiction and Fantasy  David Cronenberg
2    Drama|Musical and Performing Arts    Allison Anders
3           Drama|Mystery and Suspense    Barry Levinson
4                        Drama|Romance    Rodney Bennett

                            writer  theater_date      dvd_date currency  \
0                   Ernest Tidyman   Oct 9, 1971  Sep 25, 2001      NaN
1     David Cronenberg|Don DeLillo  Aug 17, 2012   Jan 1, 2013        $
2                   Allison Anders  Sep 13, 1996  Apr 18, 2000      NaN
3  Paul Attanasio|Michael Crichton   Dec 9, 1994  Aug 27, 1997      NaN
4                     Giles Cooper           NaN           NaN      NaN

  box_office      runtime             studio
0        NaN  104 minutes                NaN
1    600,000  108 minutes  Entertainment One
2        NaN  116 minutes                NaN
3        NaN  128 minutes                NaN
4        NaN  200 minutes                NaN

In [2]:
df.columns

Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')

In [88]:
import sqlite3
import pandas as pd

# Connect to the SQLite database
conn = sqlite3.connect('zippedData/im.db')  # Replace 'your_database.db' with your actual database file path

# Analyzing the tables and load data into a pandas DataFrame
query = "SELECT * FROM movie_ratings"  
df1 = pd.read_sql_query(query, conn)

query = "SELECT * FROM movie_basics" 
df2 = pd.read_sql_query(query, conn)

query = "SELECT * FROM movie_ratings"
df3 = pd.read_sql_query(query, conn)

query = "SELECT * FROM principals"
df4 = pd.read_sql_query(query, conn)



# Display the first few rows of the tables
print("Movie Ratings table \n",df1.head()) 
print("Movie Basics table \n",df2.head())
print("Movie Ratings table \n",df3.head())
print("Principals table \n",df4.head())

Movie Ratings table
      movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21
Movie Basics table
     movie_id                    primary_title              original_title  \
0  tt0063540                        Sunghursh                   Sunghursh
1  tt0066787  One Day Before the Rainy Season             Ashad Ka Ek Din
2  tt0069049       The Other Side of the Wind  The Other Side of the Wind
3  tt0069204                  Sabse Bada Sukh             Sabse Bada Sukh
4  tt0100275         The Wandering Soap Opera       La Telenovela Errante

   start_year  runtime_minutes                genres
0        2013            175.0    Action,Crime,Drama
1        2019            114.0       Biography,Drama
2        2018            122.0                 Drama
3        2018              NaN          Comedy,Drama
4        2017             80.0  Comedy,Drama,Fantasy
Movie Ratings table
      movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21
Principals table
     movie_id  ordering  person_id  category       job        characters
0  tt0111414         1  nm0246005     actor      None       ["The Man"]
1  tt0111414         2  nm0398271  director      None              None
2  tt0111414         3  nm3739909  producer  producer              None
3  tt0323808        10  nm0059247    editor      None              None
4  tt0323808         1  nm3579312   actress      None  ["Beth Boothby"]

In [90]:
#After keen inspection, the relevant tables will be movie_rating and movie_basics.
#The two tables will be joined using the movie_id columns from both tables.
#mb is the table movie basics while mr is the movie ratings.
query="""
SELECT 
    mb.movie_id,
    mb.original_title,
    mb.genres,
    mb.start_year,
    mr.averagerating,
    mr.numvotes
FROM 
    movie_basics AS mb
LEFT JOIN 
    movie_ratings AS mr
ON 
    mb.movie_id = mr.movie_id;"""
sql_dataset = pd.read_sql_query(query, conn)
print(df5.head())

# Close the connection
#conn.close()

    movie_id              original_title                genres  start_year  \
0  tt0063540                   Sunghursh    Action,Crime,Drama        2013
1  tt0066787             Ashad Ka Ek Din       Biography,Drama        2019
2  tt0069049  The Other Side of the Wind                 Drama        2018
3  tt0069204             Sabse Bada Sukh          Comedy,Drama        2018
4  tt0100275       La Telenovela Errante  Comedy,Drama,Fantasy        2017

   averagerating  numvotes
0            7.0      77.0
1            7.2      43.0
2            6.9    4517.0
3            6.1      13.0
4            6.5     119.0

In [92]:
sql_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   movie_id        146144 non-null  object
 1   original_title  146123 non-null  object
 2   genres          140736 non-null  object
 3   start_year      146144 non-null  int64
 4   averagerating   73856 non-null   float64
 5   numvotes        73856 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 6.7+ MB

In [16]:
#importing necessary libraries
import pandas as pd
import sqlite3

In [18]:
#Uploading the movie database
movie_database=pd.read_csv('zippedData/tmdb.movies.csv')
movie_database.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [20]:
movie_database.info() # This shows that the data does not have any null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

In [22]:
movie_database=pd.read_csv('zippedData/tmdb.movies.csv')
movie_database.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [24]:
movie_budget = pd.read_csv('zippedData/tn.movie_budgets.csv')

# Display the first few rows to confirm it's loaded correctly
print(movie_budget.head())

   id  release_date                                        movie  \
0   1  Dec 18, 2009                                       Avatar
1   2  May 20, 2011  Pirates of the Caribbean: On Stranger Tides
2   3   Jun 7, 2019                                 Dark Phoenix
3   4   May 1, 2015                      Avengers: Age of Ultron
4   5  Dec 15, 2017            Star Wars Ep. VIII: The Last Jedi

  production_budget domestic_gross worldwide_gross
0      $425,000,000   $760,507,625  $2,776,345,279
1      $410,600,000   $241,063,875  $1,045,663,875
2      $350,000,000    $42,762,350    $149,762,350
3      $330,600,000   $459,005,868  $1,403,013,963
4      $317,000,000   $620,181,382  $1,316,721,747

In [26]:
movie_budget.info()#no null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [28]:
movie_budget_clean = movie_budget.copy()
movie_budget_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [30]:
# Decode the release_date column into datetime
movie_budget_clean['release_date'] = pd.to_datetime(movie_budget_clean['release_date'], errors='coerce')

# Now clean each financial column separately
for col in ['production_budget', 'domestic_gross', 'worldwide_gross']:
    movie_budget_clean[col] = (
        movie_budget_clean[col]
        .replace({'\$': '', ',': ''}, regex=True)
        .astype(float)  # Force to float after cleaning
    )

# Feature engineering
movie_budget_clean['profit'] = movie_budget_clean['worldwide_gross'] - movie_budget_clean['production_budget']
movie_budget_clean['roi_percent'] = (movie_budget_clean['profit'] / movie_budget_clean['production_budget'] * 100).round(3) #Return of Investment
movie_budget_clean['domestic_pct'] = (movie_budget_clean['domestic_gross'] / movie_budget_clean['worldwide_gross'] * 100).round(3)# domestic % from the worldwide gross
movie_budget_clean.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,profit,roi_percent,domestic_pct
0,1,2009-12-18,Avatar,425000000.0,760507625.0,2.776345e+09,2.351345e+09,553.258,27.392
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000.0,241063875.0,1.045664e+09,6.350639e+08,154.667,23.054
2,3,2019-06-07,Dark Phoenix,350000000.0,42762350.0,1.497624e+08,-2.002376e+08,-57.211,28.553
3,4,2015-05-01,Avengers: Age of Ultron,330600000.0,459005868.0,1.403014e+09,1.072414e+09,324.384,32.716
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000.0,620181382.0,1.316722e+09,9.997217e+08,315.370,47.100

In [32]:
movie_info = pd.read_csv('zippedData/rt.movie_info.tsv', sep='\t')
print(movie_info.head())

   id                                           synopsis rating  \
0   1  This gritty, fast-paced, and innovative police...      R
1   3  New York City, not-too-distant-future: Eric Pa...      R
2   5  Illeana Douglas delivers a superb performance ...      R
3   6  Michael Douglas runs afoul of a treacherous su...      R
4   7                                                NaN     NR

                                 genre          director  \
0  Action and Adventure|Classics|Drama  William Friedkin
1    Drama|Science Fiction and Fantasy  David Cronenberg
2    Drama|Musical and Performing Arts    Allison Anders
3           Drama|Mystery and Suspense    Barry Levinson
4                        Drama|Romance    Rodney Bennett

                            writer  theater_date      dvd_date currency  \
0                   Ernest Tidyman   Oct 9, 1971  Sep 25, 2001      NaN
1     David Cronenberg|Don DeLillo  Aug 17, 2012   Jan 1, 2013        $
2                   Allison Anders  Sep 13, 1996  Apr 18, 2000      NaN
3  Paul Attanasio|Michael Crichton   Dec 9, 1994  Aug 27, 1997      NaN
4                     Giles Cooper           NaN           NaN      NaN

  box_office      runtime             studio
0        NaN  104 minutes                NaN
1    600,000  108 minutes  Entertainment One
2        NaN  116 minutes                NaN
3        NaN  128 minutes                NaN
4        NaN  200 minutes                NaN

In [34]:
movie_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

#### Relevant columns to be used are rating, genre and runtime. From here we shall create a new movie_info copy that will retain the relevant columns and drop the missing values from those columns since we want to retain the authenticity of the data.